notes/tutorial/10-26-Trees-in-Ruby.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-28 Wed 10:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Trees in Ruby</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mark Armstrong" />
<meta name="description" content="A first real look at defining tree-like data in Ruby
using classes."
 />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Trees in Ruby</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#Introduction">1. Introduction</a></li>
<li><a href="#Motivation">2. Motivation</a></li>
<li><a href="#Wednesday:-Leaf-trees-using-subclasses">3. Wednesday: Leaf trees using subclasses</a></li>
<li><a href="#Wednesday:-Leaf-trees-using-a-single-class">4. Wednesday: Leaf trees using a single class</a></li>
<li><a href="#Monday:-Leaf-trees-using-subclasses">5. Monday: Leaf trees using subclasses</a></li>
<li><a href="#Monday:-Leaf-trees-using-a-single-class">6. Monday: Leaf trees using a single class</a></li>
</ul>
</div>
</div>

<div id="outline-container-Introduction" class="outline-2">
<h2 id="Introduction"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-Introduction">
<p>
These notes were created during the tutorials on October 26th and 28th.
</p>
</div>
</div>

<div id="outline-container-Motivation" class="outline-2">
<h2 id="Motivation"><span class="section-number-2">2</span> Motivation</h2>
<div class="outline-text-2" id="text-Motivation">
</div>
</div>

<div id="outline-container-Wednesday:-Leaf-trees-using-subclasses" class="outline-2">
<h2 id="Wednesday:-Leaf-trees-using-subclasses"><span class="section-number-2">3</span> Wednesday: Leaf trees using subclasses</h2>
<div class="outline-text-2" id="text-Wednesday:-Leaf-trees-using-subclasses">
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #b6a0ff;">class</span> <span style="color: #f78fe7;">LeafTree</span>

  <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">We shouldn't be able to initialize</span>
  <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">a LeafTree directly, only one of its subclasses</span>
  <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">(there might be a better way to implement</span>
  <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">an "abstract" class like this in Ruby;</span>
  <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">I am not certain.)</span>
  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">initialize;</span> <span style="color: #f78fe7;">throw</span> <span style="color: #79a8ff;">"Cannot construct a LeafTree directly"</span> <span style="color: #b6a0ff;">end</span>
  
  <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">All LeafTree's should have a flatten</span>
  <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">But we can't really write it until we know</span>
  <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">what kind of LeafTree we have.</span>
  <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">Just throw an exception if it's called</span>
  <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">and we forgot to implement it in the subclass</span>
  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">flatten;</span> <span style="color: #f78fe7;">throw</span> <span style="color: #79a8ff;">"flatten not implemented!"</span> <span style="color: #b6a0ff;">end</span>
<span style="color: #b6a0ff;">end</span>

<span style="color: #b6a0ff;">class</span> <span style="color: #f78fe7;">Branch</span> &lt; <span style="color: #f78fe7;">LeafTree</span>
  <span style="color: #f78fe7;">attr_reader</span> <span style="color: #00bcff;">:left</span>
  <span style="color: #f78fe7;">attr_reader</span> <span style="color: #00bcff;">:right</span>
  
  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">initialize</span><span style="color: #00cd68;">(</span>l,r<span style="color: #00cd68;">)</span>
    <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">First, check immediately if these are LeafTrees</span>
    <span style="color: #b6a0ff;">if</span> l.is_a?<span style="color: #00cd68;">(</span><span style="color: #f78fe7;">LeafTree</span><span style="color: #00cd68;">)</span> &amp;&amp; r.is_a?<span style="color: #00cd68;">(</span><span style="color: #f78fe7;">LeafTree</span><span style="color: #00cd68;">)</span>
      <span style="color: #00d3d0;">@left</span> = l
      <span style="color: #00d3d0;">@right</span> = r
    <span style="color: #b6a0ff;">else</span>
      <span style="color: #f78fe7;">throw</span> <span style="color: #79a8ff;">"Constructing a branch with a non-leaftree"</span>
    <span style="color: #b6a0ff;">end</span>
  <span style="color: #b6a0ff;">end</span>

  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">flatten</span>
    <span style="color: #00d3d0;">@left</span>.flatten + <span style="color: #00d3d0;">@right</span>.flatten
    <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">flatten(@left) will cause a complaint of "too many arguments"</span>
    <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">flatten(@left) is implicitely called on "this" object,</span>
    <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">(called `self` in Ruby) so we'd be giving an extra argument.</span>
  <span style="color: #b6a0ff;">end</span>
<span style="color: #b6a0ff;">end</span>

<span style="color: #b6a0ff;">class</span> <span style="color: #f78fe7;">Leaf</span> &lt; <span style="color: #f78fe7;">LeafTree</span>
  <span style="color: #f78fe7;">attr_reader</span> <span style="color: #00bcff;">:value</span>
  
  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">initialize</span><span style="color: #00cd68;">(</span>v<span style="color: #00cd68;">)</span>
    <span style="color: #00d3d0;">@value</span> = v
  <span style="color: #b6a0ff;">end</span>

  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">flatten;</span> <span style="color: #00cd68;">[</span><span style="color: #00d3d0;">@value</span><span style="color: #00cd68;">]</span> <span style="color: #b6a0ff;">end</span>
<span style="color: #b6a0ff;">end</span>

<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">Test it out.</span>
x = <span style="color: #f78fe7;">Branch</span>.new<span style="color: #00cd68;">(</span><span style="color: #f78fe7;">Leaf</span>.new<span style="color: #b6a0ff;">(</span>1<span style="color: #b6a0ff;">)</span>,<span style="color: #f78fe7;">Leaf</span>.new<span style="color: #b6a0ff;">(</span>2<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
<span style="color: #f78fe7;">print</span> x.flatten
</pre>
</div>
</div>
</div>

<div id="outline-container-Wednesday:-Leaf-trees-using-a-single-class" class="outline-2">
<h2 id="Wednesday:-Leaf-trees-using-a-single-class"><span class="section-number-2">4</span> Wednesday: Leaf trees using a single class</h2>
<div class="outline-text-2" id="text-Wednesday:-Leaf-trees-using-a-single-class">
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #b6a0ff;">class</span> <span style="color: #f78fe7;">LeafTree</span>
  <span style="color: #f78fe7;">attr_reader</span> <span style="color: #00bcff;">:kind</span>
  <span style="color: #f78fe7;">attr_reader</span> <span style="color: #00bcff;">:value</span>
  <span style="color: #f78fe7;">attr_reader</span> <span style="color: #00bcff;">:left</span>
  <span style="color: #f78fe7;">attr_reader</span> <span style="color: #00bcff;">:right</span>

  <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">In the constructor, the second parameter</span>
  <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">defaults to nil. So if we are constructing a leaf,</span>
  <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">we just don't give the second parameter.</span>
  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">initialize</span><span style="color: #00cd68;">(</span>x, y=<span style="color: #00bcff;">nil</span><span style="color: #00cd68;">)</span>
    <span style="color: #b6a0ff;">if</span> y == <span style="color: #00bcff;">nil</span>
      <span style="color: #00d3d0;">@kind</span> = <span style="color: #00bcff;">:leaf</span>
      <span style="color: #00d3d0;">@value</span> = x
    <span style="color: #b6a0ff;">else</span>
      <span style="color: #00d3d0;">@kind</span> = <span style="color: #00bcff;">:branch</span>
      <span style="color: #00d3d0;">@left</span> = x
      <span style="color: #00d3d0;">@right</span> = y
    <span style="color: #b6a0ff;">end</span>
  <span style="color: #b6a0ff;">end</span>

  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">flatten</span>
    <span style="color: #b6a0ff;">if</span> <span style="color: #00d3d0;">@kind</span> == <span style="color: #00bcff;">:leaf</span>
      <span style="color: #00cd68;">[</span><span style="color: #00d3d0;">@value</span><span style="color: #00cd68;">]</span>
    <span style="color: #b6a0ff;">elsif</span> <span style="color: #00d3d0;">@kind</span> == <span style="color: #00bcff;">:branch</span>
      <span style="color: #00d3d0;">@left</span>.flatten + <span style="color: #00d3d0;">@right</span>.flatten
    <span style="color: #b6a0ff;">else</span>
      <span style="color: #f78fe7;">throw</span> <span style="color: #79a8ff;">"Unknown kind of LeafTree"</span>
    <span style="color: #b6a0ff;">end</span>
  <span style="color: #b6a0ff;">end</span>
<span style="color: #b6a0ff;">end</span>

x = <span style="color: #f78fe7;">LeafTree</span>.new<span style="color: #00cd68;">(</span><span style="color: #f78fe7;">LeafTree</span>.new<span style="color: #b6a0ff;">(</span>1<span style="color: #b6a0ff;">)</span>,<span style="color: #f78fe7;">LeafTree</span>.new<span style="color: #b6a0ff;">(</span>2<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
<span style="color: #f78fe7;">print</span> x.flatten
</pre>
</div>
</div>
</div>

<div id="outline-container-Monday:-Leaf-trees-using-subclasses" class="outline-2">
<h2 id="Monday:-Leaf-trees-using-subclasses"><span class="section-number-2">5</span> Monday: Leaf trees using subclasses</h2>
<div class="outline-text-2" id="text-Monday:-Leaf-trees-using-subclasses">
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #b6a0ff;">class</span> <span style="color: #f78fe7;">LeafTree</span>
<span style="color: #b6a0ff;">end</span>

<span style="color: #b6a0ff;">class</span> <span style="color: #f78fe7;">Branch</span> &lt; <span style="color: #f78fe7;">LeafTree</span>
  <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">Getters and setters for the left and right subtrees</span>
  <span style="color: #f78fe7;">attr_reader</span> <span style="color: #00bcff;">:left</span>
  <span style="color: #f78fe7;">attr_reader</span> <span style="color: #00bcff;">:right</span>

  <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">Constructor; require two trees as parameters</span>
  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">initialize</span><span style="color: #00cd68;">(</span>l,r<span style="color: #00cd68;">)</span>
    <span style="color: #b6a0ff;">if</span> l.is_a?<span style="color: #00cd68;">(</span><span style="color: #f78fe7;">LeafTree</span><span style="color: #00cd68;">)</span> &amp;&amp; r.is_a?<span style="color: #00cd68;">(</span><span style="color: #f78fe7;">LeafTree</span><span style="color: #00cd68;">)</span>
      <span style="color: #00d3d0;">@left</span> = l
      <span style="color: #00d3d0;">@right</span> = r
    <span style="color: #b6a0ff;">else</span>
      <span style="color: #f78fe7;">raise</span> <span style="color: #79a8ff;">"Branch constructed with non-leaftrees"</span>
    <span style="color: #b6a0ff;">end</span>
  <span style="color: #b6a0ff;">end</span>

  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">flatten;</span> <span style="color: #00d3d0;">@left</span>.flatten + <span style="color: #00d3d0;">@right</span>.flatten <span style="color: #b6a0ff;">end</span>
<span style="color: #b6a0ff;">end</span>

<span style="color: #b6a0ff;">class</span> <span style="color: #f78fe7;">Leaf</span> &lt; <span style="color: #f78fe7;">LeafTree</span>
  <span style="color: #f78fe7;">attr_accessor</span> <span style="color: #00bcff;">:val</span>

  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">initialize</span><span style="color: #00cd68;">(</span>v<span style="color: #00cd68;">)</span>
    <span style="color: #00d3d0;">@val</span> = v
  <span style="color: #b6a0ff;">end</span>

  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">flatten;</span> <span style="color: #00cd68;">[</span><span style="color: #00d3d0;">@val</span><span style="color: #00cd68;">]</span> <span style="color: #b6a0ff;">end</span>
<span style="color: #b6a0ff;">end</span>

z = <span style="color: #f78fe7;">Branch</span>.new<span style="color: #00cd68;">(</span>2,3<span style="color: #00cd68;">)</span>
y = <span style="color: #f78fe7;">Branch</span>.new<span style="color: #00cd68;">(</span><span style="color: #f78fe7;">Leaf</span>.new<span style="color: #b6a0ff;">(</span>1<span style="color: #b6a0ff;">)</span>, <span style="color: #f78fe7;">Leaf</span>.new<span style="color: #b6a0ff;">(</span>2<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
x = <span style="color: #f78fe7;">Branch</span>.new<span style="color: #00cd68;">(</span>y,y<span style="color: #00cd68;">)</span>
<span style="color: #f78fe7;">print</span> x.flatten
</pre>
</div>
</div>
</div>

<div id="outline-container-Monday:-Leaf-trees-using-a-single-class" class="outline-2">
<h2 id="Monday:-Leaf-trees-using-a-single-class"><span class="section-number-2">6</span> Monday: Leaf trees using a single class</h2>
<div class="outline-text-2" id="text-Monday:-Leaf-trees-using-a-single-class">
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #b6a0ff;">class</span> <span style="color: #f78fe7;">LeafTree</span>
  <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">Type is either :leaf or :branch.</span>
  <span style="color: #f78fe7;">attr_reader</span> <span style="color: #00bcff;">:type</span>

  <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">If type is :leaf, val will be set to a value.</span>
  <span style="color: #f78fe7;">attr_reader</span> <span style="color: #00bcff;">:val</span>

  <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">If type is :branch, left and right will be the subtrees.</span>
  <span style="color: #f78fe7;">attr_reader</span> <span style="color: #00bcff;">:left</span>
  <span style="color: #f78fe7;">attr_reader</span> <span style="color: #00bcff;">:right</span>

  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">initialize</span><span style="color: #00cd68;">(</span>x, y=<span style="color: #00bcff;">nil</span><span style="color: #00cd68;">)</span>
    <span style="color: #b6a0ff;">if</span> y == <span style="color: #00bcff;">nil</span>
      <span style="color: #00d3d0;">@type</span> = <span style="color: #00bcff;">:leaf</span>
      <span style="color: #00d3d0;">@val</span> = x
    <span style="color: #b6a0ff;">else</span>
      <span style="color: #00d3d0;">@type</span> = <span style="color: #00bcff;">:branch</span>
      <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">Could check here that x and y are LeafTrees</span>
      <span style="color: #00d3d0;">@left</span> = x
      <span style="color: #00d3d0;">@right</span> = y
    <span style="color: #b6a0ff;">end</span>
  <span style="color: #b6a0ff;">end</span>

  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">flatten</span>
    <span style="color: #b6a0ff;">if</span> <span style="color: #00d3d0;">@type</span> == <span style="color: #00bcff;">:leaf</span>
      <span style="color: #00cd68;">[</span><span style="color: #00d3d0;">@val</span><span style="color: #00cd68;">]</span>
    <span style="color: #b6a0ff;">elsif</span> <span style="color: #00d3d0;">@type</span> == <span style="color: #00bcff;">:branch</span>
      <span style="color: #00d3d0;">@left</span>.flatten + <span style="color: #00d3d0;">@right</span>.flatten
    <span style="color: #b6a0ff;">else</span>
      <span style="color: #f78fe7;">raise</span> <span style="color: #79a8ff;">"Unknown type of tree."</span>
    <span style="color: #b6a0ff;">end</span>
  <span style="color: #b6a0ff;">end</span>
<span style="color: #b6a0ff;">end</span>

<span style="color: #f78fe7;">print</span> <span style="color: #f78fe7;">LeafTree</span>.new<span style="color: #00cd68;">(</span><span style="color: #f78fe7;">LeafTree</span>.new<span style="color: #b6a0ff;">(</span>1<span style="color: #b6a0ff;">)</span>,<span style="color: #f78fe7;">LeafTree</span>.new<span style="color: #b6a0ff;">(</span>2<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>.flatten
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mark Armstrong</p>
     <p class="author">Contact: <a href="mailto:markparmstrong@gmail.com">markparmstrong@gmail.com</a></p>
     <p class="date">Original date: </p>
     <p class="date">Last updated: 2020-10-28 Wed 10:26</p>
     <p class="creator">Created using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.0.91 (<a href="https://orgmode.org">Org</a> mode 9.4)</p>
     <p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
